_Rarzrabotki/BASEBuh/Documents/РасчетКомплектаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РасчетКомплектаций</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьЭтапы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасчетаКомплектаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СкладыОстатков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаОстатков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаМалоценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьОстатков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщиеНазванияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПонадНорму</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Экономия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаСС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстатка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНормеСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПонадНормуСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕкономіяСума</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаНоменкл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаСуммаНоменкл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасхождениеЕдиниц</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписаниеПоНормам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщиеНазванияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписаниеСверхНормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщиеНазванияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументиКомплектації</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоНормам</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументДодаткова</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументиМалоценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоНормам</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПередачаМалоценныхАктивовВЭксплуатацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументДодаткова</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПередачаМалоценныхАктивовВЭксплуатацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Enums/СтатусыРасчетаКомплектаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыРасчетаКомплектаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетВыполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыСозданы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Documents/РасчетКомплектаций/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Метрик-панель «Підсумки»: підсвічування «В нормі» (зелений) і «Понад» (янтарний).
	Элементы.ИтогоВНорме.ЦветФона = Новый Цвет(214, 240, 214);
	Элементы.ИтогоПонад.ЦветФона  = Новый Цвет(250, 235, 200);
	// Підсвічування рядків «понад норму» в таблиці аналізу.
	УстановитьУсловноеОформлениеСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Відновлення робочого місця зі збереженого розрахунку.
	ПрименитьОтборИИтоги();
	ПересчитатьИтогиСписания();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСтрок()

	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Понад норму";

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаАнализа.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаАнализа.ПонадНорму");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250, 235, 200));

	// Розбіжність одиниць — рожевим (правило пізніше — перекриває янтарне понаднорми).
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = "Розбіжність одиниць";

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаАнализа.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаАнализа.РасхождениеЕдиниц");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250, 215, 215));

КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасчетаКомплектаций.ДокументыСозданы") Тогда
		Оповещение = Новый ОписаниеОповещения("РассчитатьПродолжение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение,
			"Документи вже створено за цим розрахунком. Перезаповнити розрахунок?",
			РежимДиалогаВопрос.ДаНет);
	Иначе
		РассчитатьПродолжение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПродолжение(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	РассчитатьНаСервере();
	ПрименитьОтборИИтоги();
	ПересчитатьИтогиСписания();
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбе(Команда)
	ЗаполнитьДокументыНаСервере(Истина, Истина);
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТолькоВНорме(Команда)
	ЗаполнитьДокументыНаСервере(Истина, Ложь);
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТолькоПонад(Команда)
	ЗаполнитьДокументыНаСервере(Ложь, Истина);
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабДок = ПечатьНаСервере();
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("Аналіз залишків (для списання)");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Попытка
		ОбъектОбработки.РассчитатьАнализ();
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");
	Сообщить("Розраховано позицій: " + Объект.ТабличнаяЧастьОстатков.Количество());
	Розбіжностей = 0;
	Для Каждого Стр Из Объект.ТабличнаяЧастьОстатков Цикл
		Если Стр.РасхождениеЕдиниц Тогда
			Розбіжностей = Розбіжностей + 1;
		КонецЕсли;
	КонецЦикла;
	Если Розбіжностей > 0 Тогда
		Сообщить("Розбіжностей одиниць: " + Розбіжностей
			+ " рядків (рожеві рядки; див. «Друк розбіжностей одиниць»).");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыНаСервере(ЗаполнятьВНорме, ЗаполнятьПонад)
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Результат = ОбъектОбработки.ЗаполнитьДокументыПоАнализу(ЗаполнятьВНорме, ЗаполнятьПонад);
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");
	ВывестиРезультатЗаполнения(Результат);
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	Если ТаблицаАнализа.Количество() = 0 Тогда
		Сообщить("Спочатку натисніть «Розрахувати».");
		Возврат Неопределено;
	КонецЕсли;
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектОбработки.СформироватьПечать(ТаблицаАнализа);
КонецФункции

&НаКлиенте
Процедура ПечатьПланФакт(Команда)
	ТабДок = ПечатьПланФактНаСервере();
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("План-факт по матеріалах");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьПланФактНаСервере()
	Если ТаблицаАнализа.Количество() = 0 Тогда
		Сообщить("Спочатку натисніть «Розрахувати».");
		Возврат Неопределено;
	КонецЕсли;
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектОбработки.СформироватьПечатьПланФакт(ТаблицаАнализа);
КонецФункции

&НаКлиенте
Процедура ПечатьПланФактЕтапи(Команда)
	ТабДок = ПечатьПланФактЕтапиНаСервере();
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("Аналіз залишків для списання за СС з етапами");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьПланФактЕтапиНаСервере()
	Если ТаблицаАнализа.Количество() = 0 Тогда
		Сообщить("Спочатку натисніть «Розрахувати».");
		Возврат Неопределено;
	КонецЕсли;
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектОбработки.СформироватьПечатьПланФактЕтапи(ТаблицаАнализа);
КонецФункции

&НаКлиенте
Процедура ПечатьАнализСС(Команда)
	ТабДок = ПечатьАнализССНаСервере();
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("Аналіз СС (план-факт списання)");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьАнализССНаСервере()
	Если ТаблицаАнализа.Количество() = 0 Тогда
		Сообщить("Спочатку натисніть «Розрахувати».");
		Возврат Неопределено;
	КонецЕсли;
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектОбработки.СформироватьПечатьАнализСС(ТаблицаАнализа);
КонецФункции

&НаКлиенте
Процедура ПечатьАнализССОдна(Команда)
	ТабДок = ПечатьАнализССОднаНаСервере();
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("Аналіз залишків для списання за СС");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьАнализССОднаНаСервере()
	Если ТаблицаАнализа.Количество() = 0 Тогда
		Сообщить("Спочатку натисніть «Розрахувати».");
		Возврат Неопределено;
	КонецЕсли;
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектОбработки.СформироватьПечатьАнализССОдна(ТаблицаАнализа);
КонецФункции

&НаСервере
Процедура ВывестиРезультатЗаполнения(Результат)
	Сообщить("Заповнено документів: " + Результат.Заповнено);
	Если Результат.Пропущено > 0 Тогда
		Сообщить("Пропущено (документ не вибраний для складу): " + Результат.Пропущено);
	КонецЕсли;
	Если Результат.БезЕдиниці > 0 Тогда
		Сообщить("Рядків без одиниці виміру (записані без одиниці): " + Результат.БезЕдиниці);
	КонецЕсли;
	Если Результат.Свойство("БезНазначення") И Результат.БезНазначення > 0 Тогда
		Сообщить("Малоцінка без призначення використання (спосіб не знайдено): " + Результат.БезНазначення);
	КонецЕсли;
	Для Каждого Помилка Из Результат.Помилки Цикл
		Сообщить(Помилка);
	КонецЦикла;
КонецПроцедуры

// === Відбір + пошук + підсумки на закладці «Аналіз залишків» ===

&НаКлиенте
Процедура ОтборСкладПриИзменении(Элемент)
	ПрименитьОтборИИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ОтборЭталонПриИзменении(Элемент)
	ПрименитьОтборИИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПошукПриИзменении(Элемент)
	ПрименитьОтборИИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоПонадНормуПриИзменении(Элемент)
	ПрименитьОтборИИтоги();
КонецПроцедуры

// Швидкий фільтр за колонкою, на якій стоїть курсор:
// «Загальна назва (еталон)» -> в шапку «Еталон»; «Склад» -> в шапку «Склад»;
// «Номенклатура» -> у поле «Пошук».
&НаКлиенте
Процедура ФильтрПоПолю(Команда)
	Таб = Элементы.ТаблицаАнализа;
	ТекЭлемент = Таб.ТекущийЭлемент;
	ИмяКолонки = ?(ТекЭлемент = Неопределено, "", ТекЭлемент.Имя);
	ПрименитьФильтрПоКолонке(ИмяКолонки, Таб.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СброситьОтбор(Команда)
	ОтборСклад = Неопределено;
	ОтборЭталон = Неопределено;
	Пошук = "";
	ТолькоПонадНорму = Ложь;
	ПрименитьОтборИИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьФильтрПоКолонке(ИмяКолонки, СтрокаДанных)
	Если СтрокаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ИмяКолонки = "ТАСклад" Тогда
		ОтборСклад = СтрокаДанных.Склад;
	ИначеЕсли ИмяКолонки = "ТАОбщееНазвание" Тогда
		ОтборЭталон = СтрокаДанных.ОбщееНазвание;
	ИначеЕсли ИмяКолонки = "ТАНоменклатура" Тогда
		Пошук = Строка(СтрокаДанных.Номенклатура);
	Иначе
		// числові колонки (Залишок/Норма/В нормі/Понад) — фільтр не застосовуємо
		Возврат;
	КонецЕсли;
	ПрименитьОтборИИтоги();
КонецПроцедуры

// Перебудовує таблицю анализа (ТаблицаАнализа) під поточний відбір/пошук
// і одночасно рахує підсумки. Джерело — повний Объект.ТабличнаяЧастьОстатков
// (заповнюється РассчитатьАнализ). Документи заповнюються з повного набору окремо.
&НаКлиенте
Процедура ПрименитьОтборИИтоги()

	ИтогоЗалишок = 0;
	ИтогоВНорме  = 0;
	ИтогоПонад   = 0;
	ИтогоЭкономия = 0;
	ИтогоСуммаОстатка = 0;
	ИтогоВНормеСума   = 0;
	ИтогоПонадСума    = 0;
	ИтогоЕкономіяСума = 0;
	ТаблицаАнализа.Очистить();

	ТекстПошуку = ВРег(СокрЛП(Пошук));

	Для Каждого Стр Из Объект.ТабличнаяЧастьОстатков Цикл

		Если ЗначениеЗаполнено(ОтборСклад) И Стр.Склад <> ОтборСклад Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОтборЭталон) И Стр.ОбщееНазвание <> ОтборЭталон Тогда
			Продолжить;
		КонецЕсли;
		Если ТолькоПонадНорму И НЕ (Стр.ПонадНорму > 0) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ТекстПошуку) Тогда
			Ціль = ВРег(Строка(Стр.Номенклатура) + " " + Строка(Стр.ОбщееНазвание) + " " + Строка(Стр.Склад) + " " + Строка(Стр.Счет));
			Если СтрНайти(Ціль, ТекстПошуку) = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		НС = ТаблицаАнализа.Добавить();
		НС.ОбщееНазвание = Стр.ОбщееНазвание;
		НС.Номенклатура  = Стр.Номенклатура;
		НС.Склад         = Стр.Склад;
			НС.Счет          = Стр.Счет;
			НС.Экономия      = Стр.Экономия;
		НС.Остаток       = Стр.Остаток;
		НС.Норма         = Стр.Норма;
		НС.ВНорме        = Стр.ВНорме;
		НС.ПонадНорму    = Стр.ПонадНорму;
		НС.Единица         = Стр.Единица;
		НС.ЕдиницаСС       = Стр.ЕдиницаСС;
		НС.СуммаОстатка    = Стр.СуммаОстатка;
		НС.НормаСумма      = Стр.НормаСумма;
		НС.ВНормеСумма     = Стр.ВНормеСумма;
		НС.ПонадНормуСумма = Стр.ПонадНормуСумма;
		НС.ЕкономіяСума    = Стр.ЕкономіяСума;
		НС.НормаНоменкл     = Стр.НормаНоменкл;
		НС.НормаСуммаНоменкл = Стр.НормаСуммаНоменкл;
		НС.Этап            = Стр.Этап;
		НС.РасхождениеЕдиниц = Стр.РасхождениеЕдиниц;

		ИтогоЗалишок = ИтогоЗалишок + Стр.Остаток;
		ИтогоВНорме  = ИтогоВНорме  + Стр.ВНорме;
		ИтогоПонад   = ИтогоПонад   + Стр.ПонадНорму;
		ИтогоЭкономия = ИтогоЭкономия + Стр.Экономия;
		ИтогоСуммаОстатка = ИтогоСуммаОстатка + Стр.СуммаОстатка;
		ИтогоВНормеСума   = ИтогоВНормеСума   + Стр.ВНормеСумма;
		ИтогоПонадСума    = ИтогоПонадСума    + Стр.ПонадНормуСумма;
		ИтогоЕкономіяСума = ИтогоЕкономіяСума + Стр.ЕкономіяСума;

	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура СверхНормыКоличествоПриИзменении(Элемент)
	Стр = Элементы.СписаниеСверхНормы.ТекущиеДанные;
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Стр.Сумма = Окр(Стр.Количество * Стр.Цена, 2);
	Если ЗначениеЗаполнено(Стр.Номенклатура) И ЗначениеЗаполнено(Стр.Склад) Тогда
		ПроверитьОстатокСтрокиНаСервере(Стр.Номенклатура, Стр.Склад, Стр.Количество);
	КонецЕсли;
	ПересчитатьИтогиСписания();
КонецПроцедуры

&НаКлиенте
Процедура СверхНормыПослеУдаления(Элемент)
	ПересчитатьИтогиСписания();
КонецПроцедуры

&НаКлиенте
Процедура СверхНормыЦенаПриИзменении(Элемент)
	Стр = Элементы.СписаниеСверхНормы.ТекущиеДанные;
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Стр.Сумма = Окр(Стр.Количество * Стр.Цена, 2);
	ПересчитатьИтогиСписания();
КонецПроцедуры

&НаКлиенте
Процедура СверхНормыНоменклатураПриИзменении(Элемент)
	ПодобратьДанныеСтрокиСверхНормы();
КонецПроцедуры

&НаКлиенте
Процедура СверхНормыСкладПриИзменении(Элемент)
	ПодобратьДанныеСтрокиСверхНормы();
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьДанныеСтрокиСверхНормы()
	Стр = Элементы.СписаниеСверхНормы.ТекущиеДанные;
	Если Стр = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Стр.Номенклатура) ИЛИ НЕ ЗначениеЗаполнено(Стр.Склад) Тогда
		Возврат;
	КонецЕсли;
	Данные = ДанныеОстаткаНаСервере(Стр.Номенклатура, Стр.Склад);
	Если Данные = Неопределено Тогда
		Сообщить("Залишок за цією номенклатурою на складі не знайдено (рахунок/ціну не підібрано).");
		Возврат;
	КонецЕсли;
	Стр.Счет = Данные.Счет;
	Стр.Единица = Данные.Единица;
	Стр.ОбщееНазвание = Данные.ОбщееНазвание;
	Стр.Цена = Данные.Цена;
	Стр.Сумма = Окр(Стр.Количество * Стр.Цена, 2);
	ПересчитатьИтогиСписания();
КонецПроцедуры

&НаСервере
Функция ДанныеОстаткаНаСервере(Номенклатура, Склад)
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектДокумента.ДанныеОстаткаДляСтроки(Номенклатура, Склад);
КонецФункции

&НаСервере
Процедура ПроверитьОстатокСтрокиНаСервере(Номенклатура, Склад, Количество)
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	Данные = ОбъектДокумента.ДанныеОстаткаДляСтроки(Номенклатура, Склад);
	Если Данные = Неопределено Тогда
		Сообщить("Увага: залишку немає — списуємо без покриття залишком.");
	ИначеЕсли Количество > Данные.Остаток Тогда
		Сообщить("Увага: кількість " + Количество + " перевищує залишок " + Данные.Остаток + ".");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиСписания()
	ИтогоНормКоличество = 0;
	ИтогоНормСумма = 0;
	Для Каждого Стр Из Объект.СписаниеПоНормам Цикл
		ИтогоНормКоличество = ИтогоНормКоличество + Стр.Количество;
		ИтогоНормСумма = ИтогоНормСумма + Стр.Сумма;
	КонецЦикла;
	ИтогоСверхКоличество = 0;
	ИтогоСверхСумма = 0;
	Для Каждого Стр Из Объект.СписаниеСверхНормы Цикл
		ИтогоСверхКоличество = ИтогоСверхКоличество + Стр.Количество;
		ИтогоСверхСумма = ИтогоСверхСумма + Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАкт(Команда)
	ТабДок = ПечатьАктНаСервере();
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("Акт на списання понаднормових матеріалів");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьАктНаСервере()
	Если Объект.СписаниеСверхНормы.Количество() = 0 Тогда
		Сообщить("Таблиця «Списання понад норму» порожня.");
		Возврат Неопределено;
	КонецЕсли;
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектДокумента.СформироватьПечатьАкт();
КонецФункции

&НаКлиенте
Процедура ПечатьРозбижности(Команда)
	ТабДок = ПечатьРозбижностиНаСервере();
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("Розбіжності одиниць (норми - фактичний прихід)");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьРозбижностиНаСервере()
	Если Объект.ТабличнаяЧастьОстатков.Количество() = 0 Тогда
		Сообщить("Спочатку натисніть «Розрахувати».");
		Возврат Неопределено;
	КонецЕсли;
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектДокумента.СформироватьПечатьРозбіжностіОдиниць();
КонецФункции
